int count = 0; // ประกาศตัวแปร count สำหรับนับจำนวนการวนลูป
void setup() {
  Serial.begin(9600); // เริ่มการสื่อสารผ่าน Serial Monitor ที่ความเร็ว 9600 บอด
}
void loop() {
  for (int chan = 0; chan < 16; chan++) { // วนลูปอ่านค่า ADC จากทั้ง 16 ช่อง
    Serial.print(analogRead(chan)); // อ่านค่าอนาล็อกจากแต่ละช่องและแสดงผล
    Serial.print("\t"); // เว้นวรรคด้วยแท็บระหว่างแต่ละค่า
  }
  Serial.print("["); // แสดงเครื่องหมายเปิดวงเล็บ
  Serial.print(count); // แสดงค่าตัวนับการวนลูป
  Serial.println("]"); // แสดงเครื่องหมายปิดวงเล็บและขึ้นบรรทัดใหม่
  count++; // เพิ่มค่าตัวนับทีละ 1
  delay(100); // หน่วงเวลาการทำงาน 100 มิลลิวินาที
}