#include <Servo.h>  // เรียกใช้ไลบรารี Servo เพื่อควบคุมเซอร์โวมอเตอร์
Servo myservo;  // สร้างออบเจ็กต์ myservo สำหรับการควบคุมเซอร์โวมอเตอร์
int potpin = A7;  // กำหนดขาพิน A7 สำหรับ potentiometer
int val;  // ตัวแปรสำหรับเก็บค่าที่อ่านได้จาก potentiometer
void setup() {
  myservo.attach(9);  // กำหนดให้เซอร์โวมอเตอร์เชื่อมต่อกับขาพินดิจิตอล 9
}
void loop() {
  val = analogRead(potpin);  // อ่านค่าอนาล็อกจาก potentiometer (ค่าจะอยู่ระหว่าง 0-1023)
  val = map(val, 0, 1023, 0, 180);  // แปลงค่าจากช่วง 0-1023 เป็นมุมเซอร์โว 0-180 องศา
  myservo.write(val);  // สั่งให้เซอร์โวหมุนไปที่มุมตามค่า val
  delay(15);  // หน่วงเวลาเล็กน้อยเพื่อให้การหมุนของเซอร์โวราบรื่น
}